## :gear: Terraform run on <!-- tf-plan:examples/demo1/terraform -->

### 🚀 Terraform Plan Summary
- 🟢 **Add**: `1`
- 🔧 **Change**: `0`
- 🗑️ **Destroy**: `0`

✅ **Plan succeeded**

<details>
<summary>⚠️ Deprecations / Warnings (Click me)</summary>

> _No deprecations or warnings found._

</details>

<details>
<summary>📖 Details (Click me)</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ebs_volume.test will be created
  + resource "aws_ebs_volume" "test" {
      + arn               = (known after apply)
      + availability_zone = "us-east-1a"
      + create_time       = (known after apply)
      + encrypted         = (known after apply)
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 10
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "infracost-local-ebs"
        }
      + tags_all          = {
          + "Name" = "infracost-local-ebs"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

🔗 [View run logs & artifacts](https://github.com/faviaitsolutionsab/cloudsmith/actions/runs/17878099892)

---
🧑‍💻 **Actor**: @aws-nitinjain
⚙️ **Event**: pull_request
📂 **Working Dir**: `examples/demo1/terraform`
🏗️ **Workflow**: PR — CloudSmith (self-test)
🔗 **Run Logs**: [View here](https://github.com/faviaitsolutionsab/cloudsmith/actions/runs/17878099892)
